//DB2BIND JOB 'DB2',NOTIFY=&SYSUID,CLASS=A,MSGCLASS=H,
//          MSGLEVEL=(1,1),REGION=4M
//BIND    EXEC PGM=IKJEFT01
//STEPLIB  DD  DISP=SHR,DSN=DB2V13.SDSNEXIT
//         DD  DISP=SHR,DSN=DB2V13.SDSNLOAD
//DBRMLIB  DD DISP=SHR,DSN=BANKZ.BOZ.BLD.DBRM(BANKDATA)
//     DD DISP=SHR,DSN=BANKZ.BOZ.BLD.DBRM(CREACC)
//     DD DISP=SHR,DSN=BANKZ.BOZ.BLD.DBRM(CRECUST)
//     DD DISP=SHR,DSN=BANKZ.BOZ.BLD.DBRM(DBCRFUN)
//     DD DISP=SHR,DSN=BANKZ.BOZ.BLD.DBRM(DELACC)
//     DD DISP=SHR,DSN=BANKZ.BOZ.BLD.DBRM(DELCUS)
//     DD DISP=SHR,DSN=BANKZ.BOZ.BLD.DBRM(INQACC)
//     DD DISP=SHR,DSN=BANKZ.BOZ.BLD.DBRM(INQACCCU)
//     DD DISP=SHR,DSN=BANKZ.BOZ.BLD.DBRM(INQCUST)
//     DD DISP=SHR,DSN=BANKZ.BOZ.BLD.DBRM(UPDACC)
//     DD DISP=SHR,DSN=BANKZ.BOZ.BLD.DBRM(UPDCUST)
//     DD DISP=SHR,DSN=BANKZ.BOZ.BLD.DBRM(XFRFUN)
//SYSPRINT DD  SYSOUT=*
//SYSTSPRT DD  SYSOUT=*
//SYSUDUMP DD  SYSOUT=*
//SYSTSIN DD *
 DSN SYSTEM(DBD1)

 BIND PACKAGE(CBSAPACK) OWNER(IBMUSER) -
 QUALIFIER(IBMUSER) -
 MEMBER(BANKDATA) -
 ACTION(REPLACE)

 BIND PACKAGE(CBSAPACK) OWNER(IBMUSER) -
 QUALIFIER(IBMUSER) -
 MEMBER(CREACC) -
 ACTION(REPLACE)

 BIND PACKAGE(CBSAPACK) OWNER(IBMUSER) -
 QUALIFIER(IBMUSER) -
 MEMBER(CRECUST) -
 ACTION(REPLACE)

 BIND PACKAGE(CBSAPACK) OWNER(IBMUSER) -
 QUALIFIER(IBMUSER) -
 MEMBER(DBCRFUN) -
 ACTION(REPLACE)

 BIND PACKAGE(CBSAPACK) OWNER(IBMUSER) -
 QUALIFIER(IBMUSER) -
 MEMBER(DELACC) -
 ACTION(REPLACE)

 BIND PACKAGE(CBSAPACK) OWNER(IBMUSER) -
 QUALIFIER(IBMUSER) -
 MEMBER(DELCUS) -
 ACTION(REPLACE)

 BIND PACKAGE(CBSAPACK) OWNER(IBMUSER) -
 QUALIFIER(IBMUSER) -
 MEMBER(INQACC) -
 ACTION(REPLACE)

 BIND PACKAGE(CBSAPACK) OWNER(IBMUSER) -
 QUALIFIER(IBMUSER) -
 MEMBER(INQACCCU) -
 ACTION(REPLACE)

 BIND PACKAGE(CBSAPACK) OWNER(IBMUSER) -
 QUALIFIER(IBMUSER) -
 MEMBER(INQCUST) -
 ACTION(REPLACE)

 BIND PACKAGE(CBSAPACK) OWNER(IBMUSER) -
 QUALIFIER(IBMUSER) -
 MEMBER(UPDACC) -
 ACTION(REPLACE)

 BIND PACKAGE(CBSAPACK) OWNER(IBMUSER) -
 QUALIFIER(IBMUSER) -
 MEMBER(UPDCUST) -
 ACTION(REPLACE)

 BIND PACKAGE(CBSAPACK) OWNER(IBMUSER) -
 QUALIFIER(IBMUSER) -
 MEMBER(XFRFUN) -
 ACTION(REPLACE)

  BIND PLAN(CBSAPLAN) -
   OWNER(IBMUSER) -
   ISOLATION(UR) -
   PKLIST( -
   NULLID.*,CBSAPACK.* )
 END
/*
//GRANT EXEC PGM=IKJEFT01,REGION=0M
//STEPLIB  DD  DISP=SHR,DSN=DB2V13.SDSNEXIT
//         DD  DISP=SHR,DSN=DB2V13.SDSNLOAD
//SYSUDUMP DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//SYSTSIN DD *
DSN SYSTEM(DBD1)
RUN PROGRAM(DSNTEP2) PLAN(DSNTEP13) -
LIB('DBD1.RUNLIB.LOAD')
//SYSIN DD *
 SET CURRENT SQLID = 'IBMUSER';
 GRANT EXECUTE ON PLAN CBSAPLAN TO CICSUSER;
 GRANT SELECT, INSERT, UPDATE, DELETE ON TABLE
     IBMUSER.ACCOUNT TO CICSUSER;
 GRANT SELECT, INSERT, UPDATE, DELETE ON TABLE
     IBMUSER.PROCTRAN TO CICSUSER;
 GRANT SELECT, INSERT, UPDATE, DELETE ON TABLE
     IBMUSER.CONTROL TO CICSUSER;
 GRANT SELECT, INSERT, UPDATE, DELETE ON TABLE
     IBMUSER.CUSTOMER TO CICSUSER;
/*
